; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v4 ?v11)
             (pred_10 ?v13 ?v2)
             (pred_6 ?v4 ?v2)
             (pred_5 ?v10 ?v4 )
	     (pred_2 ?v4)
             (pred_3 ?v12)
             (pred_9 ?v13)
             (pred_1 ?v2)
             (pred_11 ?v4)
             (pred_7 ?v13)
             (pred_4 ?v4)
             (pred_8 ))



(:action op_1
:parameters (?v1 ?v5 ?v9 ?v7)
:precondition (and (pred_3 ?v1) (pred_3 ?v5) (pred_9 ?v9) (pred_1 ?v7)
          (pred_12 ?v1 ?v5) (pred_10 ?v9 ?v7)
                   (pred_6 ?v5 ?v7) (pred_2 ?v1) 
                   (pred_11 ?v5) (pred_7 ?v9))
:effect (and  (pred_4 ?v5) (not (pred_11 ?v5))))


(:action op_5
:parameters (?v1 ?v6)
:precondition (and (pred_3 ?v1) (pred_3 ?v6)
               (pred_2 ?v1) (pred_12 ?v1 ?v6) (pred_4 ?v6))
:effect (and (pred_2 ?v6) (not (pred_2 ?v1))))

(:action op_2
:parameters (?v1 ?v9)
:precondition (and (pred_3 ?v1) (pred_9 ?v9) 
                  (pred_2 ?v1) (pred_5 ?v9 ?v1) (pred_8 ))
:effect (and (pred_7 ?v9)
   (not (pred_5 ?v9 ?v1)) (not (pred_8 ))))


(:action op_4
:parameters (?v1 ?v3 ?v8)
:precondition (and (pred_3 ?v1) (pred_9 ?v3) (pred_9 ?v8)
                  (pred_2 ?v1) (pred_7 ?v8) (pred_5 ?v3 ?v1))
:effect (and (pred_7 ?v3) (pred_5 ?v8 ?v1)
        (not (pred_7 ?v8)) (not (pred_5 ?v3 ?v1))))

(:action op_3
:parameters (?v1 ?v9)
:precondition (and (pred_3 ?v1) (pred_9 ?v9) 
                  (pred_2 ?v1) (pred_7 ?v9))
:effect (and (pred_8 ) (pred_5 ?v9 ?v1) (not (pred_7 ?v9)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_02 obj_04 obj_10 obj_09 obj_01 obj_06 obj_05 obj_03 obj_08
    obj_13 obj_07
    obj_12 obj_11
    )

    (:init
       (pred_8)

       (pred_3 obj_02)
       (pred_3 obj_04)
       (pred_3 obj_10)
       (pred_3 obj_09)
       (pred_3 obj_01)
       (pred_3 obj_06)
       (pred_3 obj_05)
       (pred_3 obj_03)
       (pred_3 obj_08)
       (pred_1 obj_13)
       (pred_1 obj_07)
       (pred_9 obj_12)
       (pred_9 obj_11)

       (pred_12 obj_02 obj_09)
       (pred_12 obj_02 obj_04)
       (pred_12 obj_04 obj_01)
       (pred_12 obj_04 obj_10)
       (pred_12 obj_04 obj_02)
       (pred_12 obj_10 obj_06)
       (pred_12 obj_10 obj_04)
       (pred_12 obj_09 obj_05)
       (pred_12 obj_09 obj_01)
       (pred_12 obj_09 obj_02)
       (pred_12 obj_01 obj_03)
       (pred_12 obj_01 obj_06)
       (pred_12 obj_01 obj_04)
       (pred_12 obj_01 obj_09)
       (pred_12 obj_06 obj_08)
       (pred_12 obj_06 obj_10)
       (pred_12 obj_06 obj_01)
       (pred_12 obj_05 obj_03)
       (pred_12 obj_05 obj_09)
       (pred_12 obj_03 obj_08)
       (pred_12 obj_03 obj_01)
       (pred_12 obj_03 obj_05)
       (pred_12 obj_08 obj_06)
       (pred_12 obj_08 obj_03)
       (pred_11 obj_08)
       (pred_11 obj_05)
       (pred_6  obj_08 obj_13)
       (pred_6  obj_05 obj_07)
       (pred_4 obj_02)
       (pred_4 obj_04)
       (pred_4 obj_10)
       (pred_4 obj_09)
       (pred_4 obj_01)
       (pred_4 obj_06)
       (pred_4 obj_03)

       (pred_10  obj_12 obj_13)
       (pred_10  obj_11 obj_07)
       (pred_5 obj_12 obj_02)
       (pred_5 obj_11 obj_09)
       (pred_2 obj_03)
    )

    (:goal (and
       (pred_5 obj_12 obj_01)
    ))
(:constraints
  (always (not (pred_2 obj_04)))
)
)

; plan
1. (op_5 obj_03 obj_01)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_01)
   goals met: 0 of 1
2. (op_5 obj_01 obj_09)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_09)
   goals met: 0 of 1
3. (op_5 obj_09 obj_02)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_02)
   goals met: 0 of 1
4. (op_2 obj_02 obj_12)
   deleted: (pred_5 obj_12 obj_02) (pred_8)
   added: (pred_7 obj_12)
   goals met: 0 of 1
5. (op_5 obj_02 obj_09)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_09)
   goals met: 0 of 1
6. (op_5 obj_09 obj_01)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_01)
   goals met: 0 of 1
7. (op_3 obj_01 obj_12)
   deleted: (pred_7 obj_12)
   added: (pred_8) (pred_5 obj_12 obj_01)
   goals met: 1 of 1
